postman collections/collection/a4b4264a-a7cf-4c3d-b201-6095dd630dcf.json

{"info":{"_postman_id":"a4b4264a-a7cf-4c3d-b201-6095dd630dcf","name":"Project#1 SOAP request","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json"},"item":[{"name":"SOAP number to words","id":"54f7f7c3-95be-4367-b530-bd71de0ac8bf","protocolProfileBehavior":{"disableBodyPruning":true,"disabledSystemHeaders":{"user-agent":true,"content-type":true}},"request":{"method":"POST","header":[{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n <soap:Body>\r\n  <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>501</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope>\r\n","options":{"raw":{"language":"xml"}}},"url":{"raw":"https://www.dataaccess.com/webservicesserver/NumberConversion.wso","protocol":"https","host":["www","dataaccess","com"],"path":["webservicesserver","NumberConversion.wso"]}},"response":[]}]}